Public Member Functions | List of all members
ACAPI::Favorite::FavoriteFolder Class Referencefinal
Favorite Management
FavoriteFolder class represents a favorite folder in the Archicad Favorite Manager. More...
#include <Favorite.hpp>
 Inheritance diagram for ACAPI::Favorite::FavoriteFolder:
 Public Member Functions
bool  | IsValid () const
Result< GS::UniString >  | GetName () const
Result< bool >  | IsRoot () const
Result< FavoriteFolder >  | GetParentFolder () const
std::vector< GS::UniString >  | GetPath () const
std::vector< FavoriteFolder >  | GetSubFolders () const
std::vector< Favorite >  | GetFavorites () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
FavoriteFolder class represents a favorite folder in the Archicad Favorite Manager.
Since
Archicad 29
Member Function Documentation
◆ GetFavorites()
 std::vector< Favorite > ACAPI::Favorite::FavoriteFolder::GetFavorites  |  ( |   | ) |   const
Returns
The favorites from the favorite folder.
◆ GetName()
 Result< GS::UniString > ACAPI::Favorite::FavoriteFolder::GetName  |  ( |   | ) |   const
Returns
The name of the favorite folder. If the favorite folder is not valid, an error is returned.
◆ GetParentFolder()
 Result< FavoriteFolder > ACAPI::Favorite::FavoriteFolder::GetParentFolder  |  ( |   | ) |   const
Returns
The parent folder of the favorite folder. If the favorite folder is not valid or the root folder, an error is returned.
◆ GetPath()
 std::vector< GS::UniString > ACAPI::Favorite::FavoriteFolder::GetPath  |  ( |   | ) |   const
Returns
The part of the path of the favorite folder.
◆ GetSubFolders()
 std::vector< FavoriteFolder > ACAPI::Favorite::FavoriteFolder::GetSubFolders  |  ( |   | ) |   const
Returns
The subfolders of the favorite folder.
◆ IsRoot()
 Result< bool > ACAPI::Favorite::FavoriteFolder::IsRoot  |  ( |   | ) |   const
Returns
True if the favorite folder is the root folder, otherwise false.
◆ IsValid()
 bool ACAPI::Favorite::FavoriteFolder::IsValid  |  ( |   | ) |   const
Returns
True if the FavoriteFolder refers to a valid favorite folder instance, otherwise false.